Benchmarks/results_destiny.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmarkDestiny.js
        output: -

     scenarios: (100.00%) 1 scenario, 900 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 900 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 900/900 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 900 VUs  0m01.0s/1m0s

running (0m02.0s), 900/900 VUs, 900 complete and 0 interrupted iterations
default   [   3% ] 900 VUs  0m02.0s/1m0s

running (0m03.0s), 900/900 VUs, 1800 complete and 0 interrupted iterations
default   [   5% ] 900 VUs  0m03.0s/1m0s

running (0m04.0s), 900/900 VUs, 2700 complete and 0 interrupted iterations
default   [   7% ] 900 VUs  0m04.0s/1m0s

running (0m05.0s), 900/900 VUs, 3600 complete and 0 interrupted iterations
default   [   8% ] 900 VUs  0m05.0s/1m0s

running (0m06.0s), 900/900 VUs, 4500 complete and 0 interrupted iterations
default   [  10% ] 900 VUs  0m06.0s/1m0s

running (0m07.0s), 900/900 VUs, 5400 complete and 0 interrupted iterations
default   [  12% ] 900 VUs  0m07.0s/1m0s

running (0m08.0s), 900/900 VUs, 6300 complete and 0 interrupted iterations
default   [  13% ] 900 VUs  0m08.0s/1m0s

running (0m09.0s), 900/900 VUs, 7200 complete and 0 interrupted iterations
default   [  15% ] 900 VUs  0m09.0s/1m0s

running (0m10.0s), 900/900 VUs, 8100 complete and 0 interrupted iterations
default   [  17% ] 900 VUs  0m10.0s/1m0s

running (0m11.0s), 900/900 VUs, 9000 complete and 0 interrupted iterations
default   [  18% ] 900 VUs  0m11.0s/1m0s

running (0m12.0s), 900/900 VUs, 9900 complete and 0 interrupted iterations
default   [  20% ] 900 VUs  0m12.0s/1m0s

running (0m13.0s), 900/900 VUs, 10800 complete and 0 interrupted iterations
default   [  22% ] 900 VUs  0m13.0s/1m0s

running (0m14.0s), 900/900 VUs, 11700 complete and 0 interrupted iterations
default   [  23% ] 900 VUs  0m14.0s/1m0s

running (0m15.0s), 900/900 VUs, 12600 complete and 0 interrupted iterations
default   [  25% ] 900 VUs  0m15.0s/1m0s

running (0m16.0s), 900/900 VUs, 13500 complete and 0 interrupted iterations
default   [  27% ] 900 VUs  0m16.0s/1m0s

running (0m17.0s), 900/900 VUs, 14400 complete and 0 interrupted iterations
default   [  28% ] 900 VUs  0m17.0s/1m0s

running (0m18.0s), 900/900 VUs, 15300 complete and 0 interrupted iterations
default   [  30% ] 900 VUs  0m18.0s/1m0s

running (0m19.0s), 900/900 VUs, 16200 complete and 0 interrupted iterations
default   [  32% ] 900 VUs  0m19.0s/1m0s

running (0m20.0s), 900/900 VUs, 17100 complete and 0 interrupted iterations
default   [  33% ] 900 VUs  0m20.0s/1m0s

running (0m21.0s), 900/900 VUs, 18000 complete and 0 interrupted iterations
default   [  35% ] 900 VUs  0m21.0s/1m0s

running (0m22.0s), 900/900 VUs, 18900 complete and 0 interrupted iterations
default   [  37% ] 900 VUs  0m22.0s/1m0s

running (0m23.0s), 900/900 VUs, 19800 complete and 0 interrupted iterations
default   [  38% ] 900 VUs  0m23.0s/1m0s

running (0m24.0s), 900/900 VUs, 20700 complete and 0 interrupted iterations
default   [  40% ] 900 VUs  0m24.0s/1m0s

running (0m25.0s), 900/900 VUs, 21600 complete and 0 interrupted iterations
default   [  42% ] 900 VUs  0m25.0s/1m0s

running (0m26.0s), 900/900 VUs, 22500 complete and 0 interrupted iterations
default   [  43% ] 900 VUs  0m26.0s/1m0s

running (0m27.0s), 900/900 VUs, 23400 complete and 0 interrupted iterations
default   [  45% ] 900 VUs  0m27.0s/1m0s

running (0m28.0s), 900/900 VUs, 24300 complete and 0 interrupted iterations
default   [  47% ] 900 VUs  0m28.0s/1m0s

running (0m29.0s), 900/900 VUs, 25200 complete and 0 interrupted iterations
default   [  48% ] 900 VUs  0m29.0s/1m0s

running (0m30.0s), 900/900 VUs, 26100 complete and 0 interrupted iterations
default   [  50% ] 900 VUs  0m30.0s/1m0s

running (0m31.0s), 900/900 VUs, 27000 complete and 0 interrupted iterations
default   [  52% ] 900 VUs  0m31.0s/1m0s

running (0m32.0s), 900/900 VUs, 27900 complete and 0 interrupted iterations
default   [  53% ] 900 VUs  0m32.0s/1m0s

running (0m33.0s), 900/900 VUs, 28800 complete and 0 interrupted iterations
default   [  55% ] 900 VUs  0m33.0s/1m0s

running (0m34.0s), 900/900 VUs, 29700 complete and 0 interrupted iterations
default   [  57% ] 900 VUs  0m34.0s/1m0s

running (0m35.0s), 900/900 VUs, 30600 complete and 0 interrupted iterations
default   [  58% ] 900 VUs  0m35.0s/1m0s

running (0m36.0s), 900/900 VUs, 31500 complete and 0 interrupted iterations
default   [  60% ] 900 VUs  0m36.0s/1m0s

running (0m37.0s), 900/900 VUs, 32400 complete and 0 interrupted iterations
default   [  62% ] 900 VUs  0m37.0s/1m0s

running (0m38.0s), 900/900 VUs, 33300 complete and 0 interrupted iterations
default   [  63% ] 900 VUs  0m38.0s/1m0s

running (0m39.0s), 900/900 VUs, 34200 complete and 0 interrupted iterations
default   [  65% ] 900 VUs  0m39.0s/1m0s

running (0m40.0s), 900/900 VUs, 35100 complete and 0 interrupted iterations
default   [  67% ] 900 VUs  0m40.0s/1m0s

running (0m41.0s), 900/900 VUs, 36000 complete and 0 interrupted iterations
default   [  68% ] 900 VUs  0m41.0s/1m0s

running (0m42.0s), 900/900 VUs, 36900 complete and 0 interrupted iterations
default   [  70% ] 900 VUs  0m42.0s/1m0s

running (0m43.0s), 900/900 VUs, 37800 complete and 0 interrupted iterations
default   [  72% ] 900 VUs  0m43.0s/1m0s

running (0m44.0s), 900/900 VUs, 38700 complete and 0 interrupted iterations
default   [  73% ] 900 VUs  0m44.0s/1m0s

running (0m45.0s), 900/900 VUs, 39600 complete and 0 interrupted iterations
default   [  75% ] 900 VUs  0m45.0s/1m0s

running (0m46.0s), 900/900 VUs, 40500 complete and 0 interrupted iterations
default   [  77% ] 900 VUs  0m46.0s/1m0s

running (0m47.0s), 900/900 VUs, 41400 complete and 0 interrupted iterations
default   [  78% ] 900 VUs  0m47.0s/1m0s

running (0m48.0s), 900/900 VUs, 42300 complete and 0 interrupted iterations
default   [  80% ] 900 VUs  0m48.0s/1m0s

running (0m49.0s), 900/900 VUs, 43200 complete and 0 interrupted iterations
default   [  82% ] 900 VUs  0m49.0s/1m0s

running (0m50.0s), 900/900 VUs, 44100 complete and 0 interrupted iterations
default   [  83% ] 900 VUs  0m50.0s/1m0s

running (0m51.0s), 900/900 VUs, 45000 complete and 0 interrupted iterations
default   [  85% ] 900 VUs  0m51.0s/1m0s

running (0m52.0s), 900/900 VUs, 45900 complete and 0 interrupted iterations
default   [  87% ] 900 VUs  0m52.0s/1m0s

running (0m53.0s), 900/900 VUs, 46800 complete and 0 interrupted iterations
default   [  88% ] 900 VUs  0m53.0s/1m0s

running (0m54.0s), 900/900 VUs, 47700 complete and 0 interrupted iterations
default   [  90% ] 900 VUs  0m54.0s/1m0s

running (0m55.0s), 900/900 VUs, 48600 complete and 0 interrupted iterations
default   [  92% ] 900 VUs  0m55.0s/1m0s

running (0m56.0s), 900/900 VUs, 49500 complete and 0 interrupted iterations
default   [  93% ] 900 VUs  0m56.0s/1m0s

running (0m57.0s), 900/900 VUs, 50400 complete and 0 interrupted iterations
default   [  95% ] 900 VUs  0m57.0s/1m0s

running (0m58.0s), 900/900 VUs, 51300 complete and 0 interrupted iterations
default   [  97% ] 900 VUs  0m58.0s/1m0s

running (0m59.0s), 900/900 VUs, 52200 complete and 0 interrupted iterations
default   [  98% ] 900 VUs  0m59.0s/1m0s

running (1m00.0s), 900/900 VUs, 53100 complete and 0 interrupted iterations
default   [ 100% ] 900 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=1.33ms min=28.85µs med=794.55µs max=33.66ms p(90)=2.1ms p(95)=3.17ms
      { expected_response:true }...: avg=1.33ms min=28.85µs med=794.55µs max=33.66ms p(90)=2.1ms p(95)=3.17ms
    http_req_failed................: 0.00%  0 out of 54000
    http_reqs......................: 54000  897.844566/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s      med=1s       max=1.05s   p(90)=1s    p(95)=1s    
    iterations.....................: 54000  897.844566/s
    vus............................: 900    min=900        max=900
    vus_max........................: 900    min=900        max=900

    NETWORK
    data_received..................: 14 MB  240 kB/s
    data_sent......................: 4.2 MB 70 kB/s



running (1m00.1s), 000/900 VUs, 54000 complete and 0 interrupted iterations
default ✓ [ 100% ] 900 VUs  1m0s

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmarkDestiny.js
        output: -

     scenarios: (100.00%) 1 scenario, 900 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 900 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 900/900 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 900 VUs  0m01.0s/1m0s

running (0m02.0s), 900/900 VUs, 900 complete and 0 interrupted iterations
default   [   3% ] 900 VUs  0m02.0s/1m0s

running (0m03.0s), 900/900 VUs, 1800 complete and 0 interrupted iterations
default   [   5% ] 900 VUs  0m03.0s/1m0s

running (0m04.0s), 900/900 VUs, 2700 complete and 0 interrupted iterations
default   [   7% ] 900 VUs  0m04.0s/1m0s

running (0m05.0s), 900/900 VUs, 3600 complete and 0 interrupted iterations
default   [   8% ] 900 VUs  0m05.0s/1m0s

running (0m06.0s), 900/900 VUs, 4500 complete and 0 interrupted iterations
default   [  10% ] 900 VUs  0m06.0s/1m0s

running (0m07.0s), 900/900 VUs, 5400 complete and 0 interrupted iterations
default   [  12% ] 900 VUs  0m07.0s/1m0s

running (0m08.0s), 900/900 VUs, 6300 complete and 0 interrupted iterations
default   [  13% ] 900 VUs  0m08.0s/1m0s

running (0m09.0s), 900/900 VUs, 7200 complete and 0 interrupted iterations
default   [  15% ] 900 VUs  0m09.0s/1m0s

running (0m10.0s), 900/900 VUs, 8100 complete and 0 interrupted iterations
default   [  17% ] 900 VUs  0m10.0s/1m0s

running (0m11.0s), 900/900 VUs, 9000 complete and 0 interrupted iterations
default   [  18% ] 900 VUs  0m11.0s/1m0s

running (0m12.0s), 900/900 VUs, 9900 complete and 0 interrupted iterations
default   [  20% ] 900 VUs  0m12.0s/1m0s

running (0m13.0s), 900/900 VUs, 10800 complete and 0 interrupted iterations
default   [  22% ] 900 VUs  0m13.0s/1m0s

running (0m14.0s), 900/900 VUs, 11700 complete and 0 interrupted iterations
default   [  23% ] 900 VUs  0m14.0s/1m0s

running (0m15.0s), 900/900 VUs, 12600 complete and 0 interrupted iterations
default   [  25% ] 900 VUs  0m15.0s/1m0s

running (0m16.0s), 900/900 VUs, 13500 complete and 0 interrupted iterations
default   [  27% ] 900 VUs  0m16.0s/1m0s

running (0m17.0s), 900/900 VUs, 14400 complete and 0 interrupted iterations
default   [  28% ] 900 VUs  0m17.0s/1m0s

running (0m18.0s), 900/900 VUs, 15300 complete and 0 interrupted iterations
default   [  30% ] 900 VUs  0m18.0s/1m0s

running (0m19.0s), 900/900 VUs, 16200 complete and 0 interrupted iterations
default   [  32% ] 900 VUs  0m19.0s/1m0s

running (0m20.0s), 900/900 VUs, 17100 complete and 0 interrupted iterations
default   [  33% ] 900 VUs  0m20.0s/1m0s

running (0m21.0s), 900/900 VUs, 18000 complete and 0 interrupted iterations
default   [  35% ] 900 VUs  0m21.0s/1m0s

running (0m22.0s), 900/900 VUs, 18900 complete and 0 interrupted iterations
default   [  37% ] 900 VUs  0m22.0s/1m0s

running (0m23.0s), 900/900 VUs, 19800 complete and 0 interrupted iterations
default   [  38% ] 900 VUs  0m23.0s/1m0s

running (0m24.0s), 900/900 VUs, 20700 complete and 0 interrupted iterations
default   [  40% ] 900 VUs  0m24.0s/1m0s

running (0m25.0s), 900/900 VUs, 21600 complete and 0 interrupted iterations
default   [  42% ] 900 VUs  0m25.0s/1m0s

running (0m26.0s), 900/900 VUs, 22500 complete and 0 interrupted iterations
default   [  43% ] 900 VUs  0m26.0s/1m0s

running (0m27.0s), 900/900 VUs, 23400 complete and 0 interrupted iterations
default   [  45% ] 900 VUs  0m27.0s/1m0s

running (0m28.0s), 900/900 VUs, 24300 complete and 0 interrupted iterations
default   [  47% ] 900 VUs  0m28.0s/1m0s

running (0m29.0s), 900/900 VUs, 25200 complete and 0 interrupted iterations
default   [  48% ] 900 VUs  0m29.0s/1m0s

running (0m30.0s), 900/900 VUs, 26100 complete and 0 interrupted iterations
default   [  50% ] 900 VUs  0m30.0s/1m0s

running (0m31.0s), 900/900 VUs, 27000 complete and 0 interrupted iterations
default   [  52% ] 900 VUs  0m31.0s/1m0s

running (0m32.0s), 900/900 VUs, 27900 complete and 0 interrupted iterations
default   [  53% ] 900 VUs  0m32.0s/1m0s

running (0m33.0s), 900/900 VUs, 28800 complete and 0 interrupted iterations
default   [  55% ] 900 VUs  0m33.0s/1m0s

running (0m34.0s), 900/900 VUs, 29700 complete and 0 interrupted iterations
default   [  57% ] 900 VUs  0m34.0s/1m0s

running (0m35.0s), 900/900 VUs, 30600 complete and 0 interrupted iterations
default   [  58% ] 900 VUs  0m35.0s/1m0s

running (0m36.0s), 900/900 VUs, 31500 complete and 0 interrupted iterations
default   [  60% ] 900 VUs  0m36.0s/1m0s

running (0m37.0s), 900/900 VUs, 32400 complete and 0 interrupted iterations
default   [  62% ] 900 VUs  0m37.0s/1m0s

running (0m38.0s), 900/900 VUs, 33300 complete and 0 interrupted iterations
default   [  63% ] 900 VUs  0m38.0s/1m0s

running (0m39.0s), 900/900 VUs, 34200 complete and 0 interrupted iterations
default   [  65% ] 900 VUs  0m39.0s/1m0s

running (0m40.0s), 900/900 VUs, 35100 complete and 0 interrupted iterations
default   [  67% ] 900 VUs  0m40.0s/1m0s

running (0m41.0s), 900/900 VUs, 36000 complete and 0 interrupted iterations
default   [  68% ] 900 VUs  0m41.0s/1m0s

running (0m42.0s), 900/900 VUs, 36900 complete and 0 interrupted iterations
default   [  70% ] 900 VUs  0m42.0s/1m0s

running (0m43.0s), 900/900 VUs, 37800 complete and 0 interrupted iterations
default   [  72% ] 900 VUs  0m43.0s/1m0s

running (0m44.0s), 900/900 VUs, 38700 complete and 0 interrupted iterations
default   [  73% ] 900 VUs  0m44.0s/1m0s

running (0m45.0s), 900/900 VUs, 39600 complete and 0 interrupted iterations
default   [  75% ] 900 VUs  0m45.0s/1m0s

running (0m46.0s), 900/900 VUs, 40500 complete and 0 interrupted iterations
default   [  77% ] 900 VUs  0m46.0s/1m0s

running (0m47.0s), 900/900 VUs, 41400 complete and 0 interrupted iterations
default   [  78% ] 900 VUs  0m47.0s/1m0s

running (0m48.0s), 900/900 VUs, 42300 complete and 0 interrupted iterations
default   [  80% ] 900 VUs  0m48.0s/1m0s

running (0m49.0s), 900/900 VUs, 43200 complete and 0 interrupted iterations
default   [  82% ] 900 VUs  0m49.0s/1m0s

running (0m50.0s), 900/900 VUs, 44100 complete and 0 interrupted iterations
default   [  83% ] 900 VUs  0m50.0s/1m0s

running (0m51.0s), 900/900 VUs, 45000 complete and 0 interrupted iterations
default   [  85% ] 900 VUs  0m51.0s/1m0s

running (0m52.0s), 900/900 VUs, 45900 complete and 0 interrupted iterations
default   [  87% ] 900 VUs  0m52.0s/1m0s

running (0m53.0s), 900/900 VUs, 46800 complete and 0 interrupted iterations
default   [  88% ] 900 VUs  0m53.0s/1m0s

running (0m54.0s), 900/900 VUs, 47700 complete and 0 interrupted iterations
default   [  90% ] 900 VUs  0m54.0s/1m0s

running (0m55.0s), 900/900 VUs, 48600 complete and 0 interrupted iterations
default   [  92% ] 900 VUs  0m55.0s/1m0s

running (0m56.0s), 900/900 VUs, 49500 complete and 0 interrupted iterations
default   [  93% ] 900 VUs  0m56.0s/1m0s

running (0m57.0s), 900/900 VUs, 50400 complete and 0 interrupted iterations
default   [  95% ] 900 VUs  0m57.0s/1m0s

running (0m58.0s), 900/900 VUs, 51300 complete and 0 interrupted iterations
default   [  97% ] 900 VUs  0m58.0s/1m0s

running (0m59.0s), 900/900 VUs, 52200 complete and 0 interrupted iterations
default   [  98% ] 900 VUs  0m59.0s/1m0s

running (1m00.0s), 900/900 VUs, 53100 complete and 0 interrupted iterations
default   [ 100% ] 900 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=1.07ms min=25.03µs med=877.27µs max=30.64ms p(90)=1.7ms p(95)=2.14ms
      { expected_response:true }...: avg=1.07ms min=25.03µs med=877.27µs max=30.64ms p(90)=1.7ms p(95)=2.14ms
    http_req_failed................: 0.00%  0 out of 54000
    http_reqs......................: 54000  898.16573/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s      med=1s       max=1.04s   p(90)=1s    p(95)=1s    
    iterations.....................: 54000  898.16573/s
    vus............................: 900    min=900        max=900
    vus_max........................: 900    min=900        max=900

    NETWORK
    data_received..................: 14 MB  240 kB/s
    data_sent......................: 4.2 MB 70 kB/s



running (1m00.1s), 000/900 VUs, 54000 complete and 0 interrupted iterations
default ✓ [ 100% ] 900 VUs  1m0s

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmarkDestiny.js
        output: -

     scenarios: (100.00%) 1 scenario, 900 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 900 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 900/900 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 900 VUs  0m01.0s/1m0s

running (0m02.0s), 900/900 VUs, 900 complete and 0 interrupted iterations
default   [   3% ] 900 VUs  0m02.0s/1m0s

running (0m03.0s), 900/900 VUs, 1800 complete and 0 interrupted iterations
default   [   5% ] 900 VUs  0m03.0s/1m0s

running (0m04.0s), 900/900 VUs, 2700 complete and 0 interrupted iterations
default   [   7% ] 900 VUs  0m04.0s/1m0s

running (0m05.0s), 900/900 VUs, 3600 complete and 0 interrupted iterations
default   [   8% ] 900 VUs  0m05.0s/1m0s

running (0m06.0s), 900/900 VUs, 4500 complete and 0 interrupted iterations
default   [  10% ] 900 VUs  0m06.0s/1m0s

running (0m07.0s), 900/900 VUs, 5400 complete and 0 interrupted iterations
default   [  12% ] 900 VUs  0m07.0s/1m0s

running (0m08.0s), 900/900 VUs, 6300 complete and 0 interrupted iterations
default   [  13% ] 900 VUs  0m08.0s/1m0s

running (0m09.0s), 900/900 VUs, 7200 complete and 0 interrupted iterations
default   [  15% ] 900 VUs  0m09.0s/1m0s

running (0m10.0s), 900/900 VUs, 8100 complete and 0 interrupted iterations
default   [  17% ] 900 VUs  0m10.0s/1m0s

running (0m11.0s), 900/900 VUs, 9000 complete and 0 interrupted iterations
default   [  18% ] 900 VUs  0m11.0s/1m0s

running (0m12.0s), 900/900 VUs, 9900 complete and 0 interrupted iterations
default   [  20% ] 900 VUs  0m12.0s/1m0s

running (0m13.0s), 900/900 VUs, 10800 complete and 0 interrupted iterations
default   [  22% ] 900 VUs  0m13.0s/1m0s

running (0m14.0s), 900/900 VUs, 11700 complete and 0 interrupted iterations
default   [  23% ] 900 VUs  0m14.0s/1m0s

running (0m15.0s), 900/900 VUs, 12600 complete and 0 interrupted iterations
default   [  25% ] 900 VUs  0m15.0s/1m0s

running (0m16.0s), 900/900 VUs, 13500 complete and 0 interrupted iterations
default   [  27% ] 900 VUs  0m16.0s/1m0s

running (0m17.0s), 900/900 VUs, 14400 complete and 0 interrupted iterations
default   [  28% ] 900 VUs  0m17.0s/1m0s

running (0m18.0s), 900/900 VUs, 15300 complete and 0 interrupted iterations
default   [  30% ] 900 VUs  0m18.0s/1m0s

running (0m19.0s), 900/900 VUs, 16200 complete and 0 interrupted iterations
default   [  32% ] 900 VUs  0m19.0s/1m0s

running (0m20.0s), 900/900 VUs, 17100 complete and 0 interrupted iterations
default   [  33% ] 900 VUs  0m20.0s/1m0s

running (0m21.0s), 900/900 VUs, 18000 complete and 0 interrupted iterations
default   [  35% ] 900 VUs  0m21.0s/1m0s

running (0m22.0s), 900/900 VUs, 18900 complete and 0 interrupted iterations
default   [  37% ] 900 VUs  0m22.0s/1m0s

running (0m23.0s), 900/900 VUs, 19800 complete and 0 interrupted iterations
default   [  38% ] 900 VUs  0m23.0s/1m0s

running (0m24.0s), 900/900 VUs, 20700 complete and 0 interrupted iterations
default   [  40% ] 900 VUs  0m24.0s/1m0s

running (0m25.0s), 900/900 VUs, 21600 complete and 0 interrupted iterations
default   [  42% ] 900 VUs  0m25.0s/1m0s

running (0m26.0s), 900/900 VUs, 22500 complete and 0 interrupted iterations
default   [  43% ] 900 VUs  0m26.0s/1m0s

running (0m27.0s), 900/900 VUs, 23400 complete and 0 interrupted iterations
default   [  45% ] 900 VUs  0m27.0s/1m0s

running (0m28.0s), 900/900 VUs, 24300 complete and 0 interrupted iterations
default   [  47% ] 900 VUs  0m28.0s/1m0s

running (0m29.0s), 900/900 VUs, 25200 complete and 0 interrupted iterations
default   [  48% ] 900 VUs  0m29.0s/1m0s

running (0m30.0s), 900/900 VUs, 26100 complete and 0 interrupted iterations
default   [  50% ] 900 VUs  0m30.0s/1m0s

running (0m31.0s), 900/900 VUs, 27000 complete and 0 interrupted iterations
default   [  52% ] 900 VUs  0m31.0s/1m0s

running (0m32.0s), 900/900 VUs, 27900 complete and 0 interrupted iterations
default   [  53% ] 900 VUs  0m32.0s/1m0s

running (0m33.0s), 900/900 VUs, 28800 complete and 0 interrupted iterations
default   [  55% ] 900 VUs  0m33.0s/1m0s

running (0m34.0s), 900/900 VUs, 29700 complete and 0 interrupted iterations
default   [  57% ] 900 VUs  0m34.0s/1m0s

running (0m35.0s), 900/900 VUs, 30600 complete and 0 interrupted iterations
default   [  58% ] 900 VUs  0m35.0s/1m0s

running (0m36.0s), 900/900 VUs, 31500 complete and 0 interrupted iterations
default   [  60% ] 900 VUs  0m36.0s/1m0s

running (0m37.0s), 900/900 VUs, 32400 complete and 0 interrupted iterations
default   [  62% ] 900 VUs  0m37.0s/1m0s

running (0m38.0s), 900/900 VUs, 33300 complete and 0 interrupted iterations
default   [  63% ] 900 VUs  0m38.0s/1m0s

running (0m39.0s), 900/900 VUs, 34200 complete and 0 interrupted iterations
default   [  65% ] 900 VUs  0m39.0s/1m0s

running (0m40.0s), 900/900 VUs, 35100 complete and 0 interrupted iterations
default   [  67% ] 900 VUs  0m40.0s/1m0s

running (0m41.0s), 900/900 VUs, 36000 complete and 0 interrupted iterations
default   [  68% ] 900 VUs  0m41.0s/1m0s

running (0m42.0s), 900/900 VUs, 36900 complete and 0 interrupted iterations
default   [  70% ] 900 VUs  0m42.0s/1m0s

running (0m43.0s), 900/900 VUs, 37800 complete and 0 interrupted iterations
default   [  72% ] 900 VUs  0m43.0s/1m0s

running (0m44.0s), 900/900 VUs, 38700 complete and 0 interrupted iterations
default   [  73% ] 900 VUs  0m44.0s/1m0s

running (0m45.0s), 900/900 VUs, 39600 complete and 0 interrupted iterations
default   [  75% ] 900 VUs  0m45.0s/1m0s

running (0m46.0s), 900/900 VUs, 40500 complete and 0 interrupted iterations
default   [  77% ] 900 VUs  0m46.0s/1m0s

running (0m47.0s), 900/900 VUs, 41400 complete and 0 interrupted iterations
default   [  78% ] 900 VUs  0m47.0s/1m0s

running (0m48.0s), 900/900 VUs, 42300 complete and 0 interrupted iterations
default   [  80% ] 900 VUs  0m48.0s/1m0s

running (0m49.0s), 900/900 VUs, 43200 complete and 0 interrupted iterations
default   [  82% ] 900 VUs  0m49.0s/1m0s

running (0m50.0s), 900/900 VUs, 44100 complete and 0 interrupted iterations
default   [  83% ] 900 VUs  0m50.0s/1m0s

running (0m51.0s), 900/900 VUs, 45000 complete and 0 interrupted iterations
default   [  85% ] 900 VUs  0m51.0s/1m0s

running (0m52.0s), 900/900 VUs, 45900 complete and 0 interrupted iterations
default   [  87% ] 900 VUs  0m52.0s/1m0s

running (0m53.0s), 900/900 VUs, 46800 complete and 0 interrupted iterations
default   [  88% ] 900 VUs  0m53.0s/1m0s

running (0m54.0s), 900/900 VUs, 47700 complete and 0 interrupted iterations
default   [  90% ] 900 VUs  0m54.0s/1m0s

running (0m55.0s), 900/900 VUs, 48600 complete and 0 interrupted iterations
default   [  92% ] 900 VUs  0m55.0s/1m0s

running (0m56.0s), 900/900 VUs, 49500 complete and 0 interrupted iterations
default   [  93% ] 900 VUs  0m56.0s/1m0s

running (0m57.0s), 900/900 VUs, 50400 complete and 0 interrupted iterations
default   [  95% ] 900 VUs  0m57.0s/1m0s

running (0m58.0s), 900/900 VUs, 51300 complete and 0 interrupted iterations
default   [  97% ] 900 VUs  0m58.0s/1m0s

running (0m59.0s), 900/900 VUs, 52200 complete and 0 interrupted iterations
default   [  98% ] 900 VUs  0m59.0s/1m0s

running (1m00.0s), 900/900 VUs, 53100 complete and 0 interrupted iterations
default   [ 100% ] 900 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=888.09µs min=32.45µs med=593.77µs max=26.58ms p(90)=1.58ms p(95)=2.36ms
      { expected_response:true }...: avg=888.09µs min=32.45µs med=593.77µs max=26.58ms p(90)=1.58ms p(95)=2.36ms
    http_req_failed................: 0.00%  0 out of 54000
    http_reqs......................: 54000  898.320359/s

    EXECUTION
    iteration_duration.............: avg=1s       min=1s      med=1s       max=1.03s   p(90)=1s     p(95)=1s    
    iterations.....................: 54000  898.320359/s
    vus............................: 900    min=900        max=900
    vus_max........................: 900    min=900        max=900

    NETWORK
    data_received..................: 14 MB  240 kB/s
    data_sent......................: 4.2 MB 70 kB/s



running (1m00.1s), 000/900 VUs, 54000 complete and 0 interrupted iterations
default ✓ [ 100% ] 900 VUs  1m0s